driver-tests/httpsoapbc/urlrewriting/URLRewritingBpel/src/Vodafone/TroubleTicket.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<!--  Generated by "ip value MEC"

	IP VALUE GmbH
	Stockholmer Allee 24
	D-44269 Dortmund
	GERMANY

	www.ip-value.de

	Copyright (c) 2005 IP VALUE GmbH, all rights reserved -->

<wsdl:definitions name="TroubleTicketWebService"
	xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
	xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
	xmlns:http="http://schemas.xmlsoap.org/wsdl/http/"
	xmlns:xs="http://www.w3.org/2001/XMLSchema"
	xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
	xmlns:mime="http://schemas.xmlsoap.org/wsdl/mime/"
	xmlns:tt="http://java.sun.com/products/oss/xml/TroubleTicket"
	xmlns:TroubleTicketWSNS="http://java.sun.com/products/oss/xml/TroubleTicket/wsdl"
	targetNamespace="http://java.sun.com/products/oss/xml/TroubleTicket/wsdl" xmlns="http://schemas.xmlsoap.org/wsdl/">

	<!-- ========================== WSDL Imports =========================== -->

	<!-- ===================== Types Definitions ====================== -->
	<wsdl:types>
		<xsd:schema
			targetNamespace="http://java.sun.com/products/oss/xml/TroubleTicketTNS"
			xmlns:xsd="http://www.w3.org/2001/XMLSchema">
			<xsd:import
				namespace="http://java.sun.com/products/oss/xml/TroubleTicket"
  				schemaLocation="XmlTroubleTicketSchema.xsd"/>
 		</xsd:schema>
	</wsdl:types>


	<!-- ===================== Message Definitions ====================== -->

	<wsdl:message name="getTroubleTicketByKeyRequest">
		<wsdl:part name="parameter" element="tt:getTroubleTicketByKeyRequest" />
	</wsdl:message>
	<wsdl:message name="getTroubleTicketByKeyResponse">
		<wsdl:part name="parameter" element="tt:getTroubleTicketByKeyResponse" />
	</wsdl:message>
	<wsdl:message name="getTroubleTicketByKeyException">
		<wsdl:part name="parameter" element="tt:getTroubleTicketByKeyException" />
	</wsdl:message>



	<!-- ===================== PortType Definitions ====================== -->
	<wsdl:portType name="TroubleTicketWSPort">

		<wsdl:operation name="getTroubleTicketByKey">
			<wsdl:input message="TroubleTicketWSNS:getTroubleTicketByKeyRequest" />
			<wsdl:output message="TroubleTicketWSNS:getTroubleTicketByKeyResponse" />
			<wsdl:fault name="getTroubleTicketByKeyException" message="TroubleTicketWSNS:getTroubleTicketByKeyException" />
		</wsdl:operation>


	</wsdl:portType>


	<!-- ===================== Binding Definitions ====================== -->
	<wsdl:binding name="TroubleTicketSoapBinding" type="TroubleTicketWSNS:TroubleTicketWSPort">
		<soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>


		<wsdl:operation name="getTroubleTicketByKey">
                    <soap:operation soapAction="" />
			<wsdl:input>
				<soap:body use="literal" />
			</wsdl:input>
			<wsdl:output>
				<soap:body use="literal" />
			</wsdl:output>
			<wsdl:fault name="getTroubleTicketByKeyException">
				<soap:fault name="getTroubleTicketByKeyException" use="literal" />
			</wsdl:fault>
		</wsdl:operation>

 	</wsdl:binding>


	<!-- ===================== Service Definition ====================== -->
	<wsdl:service name="TroubleTicketWebService">
		<wsdl:port name="TroubleTicketWSPort" binding="TroubleTicketWSNS:TroubleTicketSoapBinding">
 			<soap:address location="http://localhost:22000/TroubleTicket"/>
 		</wsdl:port>
	</wsdl:service>


</wsdl:definitions>

