driver-tests/httpsoapbc/urlrewriting/URLRewritingJBI/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tro="http://java.sun.com/products/oss/xml/TroubleTicket" xmlns:com="http://java.sun.com/products/oss/xml/Common">
  <soapenv:Body>
    <tro:getTroubleTicketByKeyRequest>
      <tro:troubleTicketKey>
        <!--Optional:-->
        <com:applicationContext>
          <com:factoryClass>factoryClassNameString</com:factoryClass>
          <com:url>http://www.company.org/cum/sonoras</com:url>
          <com:systemProperties>
            <!--Zero or more repetitions:-->
            <com:property>
              <com:name>nameString</com:name>
              <com:value>nameValue</com:value>
            </com:property>
          </com:systemProperties>
        </com:applicationContext>
        <!--Optional:-->
        <com:applicationDN>applicationDNString</com:applicationDN>
        <com:type>typeString</com:type>
        <tro:primaryKey>primaryKeyString</tro:primaryKey>
      </tro:troubleTicketKey>
      <!--Optional:-->
      <tro:attrNames>
        <!--1 or more repetitions:-->
        <com:item>item1</com:item>
      </tro:attrNames>
    </tro:getTroubleTicketByKeyRequest>
  </soapenv:Body>
</soapenv:Envelope>